<a href="https://colab.research.google.com/github/19pa1a0207/AI-Lab/blob/master/Exp_2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Experiment 2:Pandas

##1.Create a data Frame manually.

In [60]:
import pandas as pd
df=pd.DataFrame([["EEE207","B.DHATRI",22],["EEE208","B.JITHENDRA",23],["EEE209","B.SRAVANI",23]],columns = ["Roll No","Name","Age"])
df

  Roll No         Name  Age
0  EEE207     B.DHATRI   22
1  EEE208  B.JITHENDRA   23
2  EEE209    B.SRAVANI   23

##2.Different ways of importing a dataframe.

In [61]:
import pandas as pd
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

In [62]:
df.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [63]:
df.describe()

          Roll No  SSC Percentage  ...  B.Tech_percentage    Backlogs
count  117.000000      116.000000  ...         117.000000  117.000000
mean    59.000000       80.474569  ...          62.943419    4.111111
std     33.919021        8.836079  ...          12.064306    6.335148
min      1.000000       47.800000  ...          31.200000    0.000000
25%     30.000000       76.622500  ...          54.180000    0.000000
50%     59.000000       82.745000  ...          64.360000    0.000000
75%     88.000000       87.025000  ...          72.570000    7.000000
max    117.000000       93.660000  ...          88.100000   25.000000

[8 rows x 5 columns]

In [64]:
df.shape

(117, 9)

##3.Adding,Deleting,Modifying the row/columns in a dataframe.

###3.1)Adding a column

In [65]:
hostler = pd.read_csv("hostlers_day_scholars.csv")
hostler.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [81]:
df["hostler/days scholar"] = hostler.values
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN
5      6.0      M  ...                   NaN               NaN

[5 rows x 17 columns]

###3.2)Deleting a column

In [82]:
del df["registered_for_Placement_Training"] 
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN
5      6.0      M  ...                   NaN               NaN

[5 rows x 16 columns]

###3.3)Adding a row

In [80]:
df1 = pd.DataFrame({"Rollno":[118],"Gender":["F"],"Section":["C"],"SSC Percentage":[98.4],"inter_Diploma_peecentage":[99],"B.Tech_percentage":[75],"Backlogs":[0],"registered_for_Placement_Training":["Not applicable"],"hostler/day's scholar":["hostler"],"placement_status":["Not placed"]})
df1

   Rollno Gender  ... hostler/day's scholar  placement_status
0     118      F  ...               hostler        Not placed

[1 rows x 10 columns]

In [84]:
df = df.append(df1)
df.head()

   Roll No Gender  ... placement_status  registered_for_Placement_Training
0      1.0      M  ...              NaN                                NaN
1      2.0      F  ...              NaN                                NaN
2      3.0      F  ...              NaN                                NaN
4      5.0      M  ...              NaN                                NaN
5      6.0      M  ...              NaN                                NaN

[5 rows x 17 columns]

###3.4)Deleting a row

In [78]:
df = df.drop(3)
df.head()

   Roll No Gender  ... Urban/Rural  hostlers/days scholar
0        1      M  ...       Urban                    NaN
1        2      F  ...       Rural                hostler
2        3      F  ...       Urban                    NaN
4        5      M  ...       Urban                    NaN
5        6      M  ...       Rural                    NaN

[5 rows x 12 columns]

##3.5)Modifying elements

In [77]:
df.loc[1,"hostlers/days scholar"] = "hostler"
df.head()

   Roll No Gender  ... Urban/Rural  hostlers/days scholar
0        1      M  ...       Urban                    NaN
1        2      F  ...       Rural                hostler
2        3      F  ...       Urban                    NaN
3        4      M  ...       Urban                    NaN
4        5      M  ...       Urban                    NaN

[5 rows x 12 columns]

#4.Applying functions on a dataframe.

In [75]:
def gracep(x):
  if (x<70):
     return (x+0.05)
  else:
     return (x)

In [76]:
df["B.Tech_percentage"] = df["B.Tech_percentage"].apply(gracep)
df.head()

   Roll No Gender Section  ...  placement status  hostler/days scholar  Urban/Rural
0        1      M       A  ...        Not placed                     d        Urban
1        2      F       A  ...            Placed                     d        Rural
2        3      F       A  ...        Not placed                     d        Urban
3        4      M       A  ...        Not placed                     d        Urban
4        5      M       A  ...        Not placed                     h        Urban

[5 rows x 11 columns]

#5.Iterations on dataframe.

In [74]:
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
   print(rows["Roll No"]),"-",(rows["B.Tech_percentage"])

18
60
71
97
102

#6.Accessing the elements from a dataframe.

In [73]:
df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

#7.Different ways to deal with NA's in dataframe.

In [72]:
import pandas as pd
import numpy as np
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender Section  ...  placement status  hostler/days scholar  Urban/Rural
0        1      M       A  ...        Not placed                     d        Urban
1        2      F       A  ...            Placed                     d        Rural
2        3      F       A  ...        Not placed                     d        Urban
3        4      M       A  ...        Not placed                     d        Urban
4        5      M       A  ...        Not placed                     h        Urban

[5 rows x 11 columns]

##8.Groupby operations on dataframe.

In [71]:
group = df.groupby("Gender")
group["B.Tech_percentage"].agg(np.mean)

Gender
F    71.199388
M    56.994265
Name: B.Tech_percentage, dtype: float64

##9.Merging the dataframes.

In [70]:
df2 = pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [69]:
df = pd.merge(df,df2,on = "Roll No")
df.head()

   Roll No Gender Section  ...  placement status  hostler/days scholar  Urban/Rural
0        1      M       A  ...        Not placed                     d        Urban
1        2      F       A  ...            Placed                     d        Rural
2        3      F       A  ...        Not placed                     d        Urban
3        4      M       A  ...        Not placed                     d        Urban
4        5      M       A  ...        Not placed                     h        Urban

[5 rows x 11 columns]